# Preprocessing

In [36]:
# import lybraris
import numpy as np
import pandas as pd
from sklearn import preprocessing

In [37]:
tot = pd.read_csv('./season5/c_data.csv',header=1,na_values=['?','??','???'])

In [38]:
tot.head()

,1,CountryName,CountryCode,Population growth,Total population,Area (sq. km)
0,2,Brazil,BRA,0.817556,207652865.0,8358140.0
1,3,Switzerland,CHE,1.077221,8372098.0,39516.0
2,4,Germany,DEU,1.193867,82667685.0,348900.0
3,5,Denmark,DNK,0.834638,NaN,42262.0
4,6,Spain,ESP,-0.008048,46443959.0,500210.0

In [39]:
tod = tot.copy()

In [40]:
tod.rename(columns={
    'CountryName':'Name',
    'CountryCode':'Code',
    'Population growth':'Pop',
    'Total population':'T_Pop',
    'Area (sq. km)':'Area'
},inplace=True)

In [41]:
tod.head()

   1         Name Code       Pop        T_Pop       Area
0  2       Brazil  BRA  0.817556  207652865.0  8358140.0
1  3  Switzerland  CHE  1.077221    8372098.0    39516.0
2  4      Germany  DEU  1.193867   82667685.0   348900.0
3  5      Denmark  DNK  0.834638          NaN    42262.0
4  6        Spain  ESP -0.008048   46443959.0   500210.0

### Delete some Column,without effect

In [42]:
tod.drop('Code',axis=1,inplace=True)

In [43]:
tod.drop('1',axis=1,inplace=True)

In [44]:
tod.head()

          Name       Pop        T_Pop       Area
0       Brazil  0.817556  207652865.0  8358140.0
1  Switzerland  1.077221    8372098.0    39516.0
2      Germany  1.193867   82667685.0   348900.0
3      Denmark  0.834638          NaN    42262.0
4        Spain -0.008048   46443959.0   500210.0

In [45]:
tod.rename(index=tod.Name,inplace=True)

In [46]:
tod.head()

                    Name       Pop        T_Pop       Area
Brazil            Brazil  0.817556  207652865.0  8358140.0
Switzerland  Switzerland  1.077221    8372098.0    39516.0
Germany          Germany  1.193867   82667685.0   348900.0
Denmark          Denmark  0.834638          NaN    42262.0
Spain              Spain -0.008048   46443959.0   500210.0

In [47]:
tod.drop('Name',axis=1,inplace=True)

In [48]:
tod.head()

                  Pop        T_Pop       Area
Brazil       0.817556  207652865.0  8358140.0
Switzerland  1.077221    8372098.0    39516.0
Germany      1.193867   82667685.0   348900.0
Denmark      0.834638          NaN    42262.0
Spain       -0.008048   46443959.0   500210.0

In [49]:
tod.info()

<class 'pandas.core.frame.DataFrame'>
Index: 16 entries, Brazil to World
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Pop     14 non-null     float64
 1   T_Pop   15 non-null     float64
 2   Area    15 non-null     float64
dtypes: float64(3)
memory usage: 512.0+ bytes

In [50]:
tod.describe()

             Pop         T_Pop          Area
count  14.000000  1.500000e+01  1.500000e+01
mean    1.145492  6.422767e+08  9.762744e+06
std     1.173195  1.909868e+09  3.325701e+07
min    -0.687543  2.569804e+06  1.161000e+04
25%     0.510007  1.032493e+07  2.389000e+05
50%     1.112718  6.689611e+07  4.463000e+05
75%     1.190820  1.564921e+08  1.269765e+06
max     3.495070  7.442136e+09  1.297332e+08

In [51]:
tod.max()

Pop      3.495070e+00
T_Pop    7.442136e+09
Area     1.297332e+08
dtype: float64

In [54]:
# we can see that we have World population also,and this make our data False for prediction
maxT_pop = tod['T_Pop'].max()

In [55]:
maxT_pop

7442135578.0